OpenFOAM/OpenFOAM-7/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/pyrolysisRegion/char
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      Ychar;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            zeroGradient;
    }

    oneDEmptyPatch
    {
        type            empty;
    }
}


// ************************************************************************* //
